In [1]:
import numpy as np
import pandas as pd
import torch.nn as nn
import torch.nn.parallel
import torch.optim as optim
import torch.utils.data
from torch.autograd import Variable

In [2]:
# Import the dataset
movies = pd.read_csv('ml-1m/movies.dat', sep = '::', header =None, engine='python', encoding= 'latin-1') 
# this dosent contain header So we specify header =None
# engine='python' --> dataset to work efficient

In [3]:
movies.head()

   0                                   1                             2
0  1                    Toy Story (1995)   Animation|Children's|Comedy
1  2                      Jumanji (1995)  Adventure|Children's|Fantasy
2  3             Grumpier Old Men (1995)                Comedy|Romance
3  4            Waiting to Exhale (1995)                  Comedy|Drama
4  5  Father of the Bride Part II (1995)                        Comedy

In [4]:
users =  pd.read_csv('ml-1m/users.dat', sep = '::', header =None, engine='python', encoding= 'latin-1')
users.head()
# id, gender, age

   0  1   2   3      4
0  1  F   1  10  48067
1  2  M  56  16  70072
2  3  M  25  15  55117
3  4  M  45   7  02460
4  5  M  25  20  55455

In [5]:
ratings =  pd.read_csv('ml-1m/ratings.dat', sep = '::', header =None, engine='python', encoding= 'latin-1')
ratings.head() 
# users, movie_id, ratings

   0     1  2          3
0  1  1193  5  978300760
1  1   661  3  978302109
2  1   914  3  978301968
3  1  3408  4  978300275
4  1  2355  5  978824291

In [6]:
# Prepare train and test set
training_set = pd.read_csv('ml-100k/u1.base', delimiter='\t') # has 80000 ratings

In [7]:
training_set.head()
# users, movie_id, ratings

   1  1.1  5  874965758
0  1    2  3  876893171
1  1    3  4  878542960
2  1    4  3  876893119
3  1    5  3  889751712
4  1    7  4  875071561

In [8]:
# convert training set to array
training_set = np.array(training_set, dtype='int')

In [9]:
# Prepare train and test set
test_set = pd.read_csv('ml-100k/u1.test', delimiter='\t')
test_set = np.array(test_set, dtype='int')

In [10]:
test_set

array([[        1,        10,         3, 875693118],
       [        1,        12,         5, 878542960],
       [        1,        14,         5, 874965706],
       ...,
       [      459,       934,         3, 879563639],
       [      460,        10,         3, 882912371],
       [      462,       682,         5, 886365231]])

In [11]:
# Getting the number of movies and users
nb_users = int(max(max(training_set[:,0]), max(test_set[:,0]))) # max of max because to ge the max of both test, training!
nb_movies = int(max(max(training_set[:,1]), max(test_set[:,1])))
print(nb_users)
print(nb_movies)

943
1682

In [12]:
# Converting the data into an array with users in lines and movies in column
def convert(data):
    new_data = [] #we do list of list, 1st list for 1st user, 2nd list for 2nd user etc
    for id_users in range(1, nb_users + 1):
        id_movies = data[:, 1][data[:,0] == id_users] # movies indexs of all rated movies
        id_ratings = data[:, 2][data[:,0] == id_users]# 1st list --> ratings of the 1st user and so on
        ratings = np.zeros(nb_movies) # list of nb_movies list
        ratings[id_movies - 1] = id_ratings   # Replace 0 by 1 , '-1' -->  because we have index starting from 0, 'id_ratings' --> update with real ratings
        new_data.append(list(ratings)) # for all the users
    return new_data

In [13]:
training_set = convert(training_set)

In [14]:
test_set = convert(test_set)